ezois_ka/oooezoiskaobmen/src/Documents/ОтказВВозмещенииВыплатРодителямДетейИнвалидов/ОтказВВозмещенииВыплатРодителямДетейИнвалидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтказВВозмещенииВыплатРодителямДетейИнвалидов</name>
  <comment>Тип СЭДО 122, 12210</comment>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСообщения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Загружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РешениеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РешениеДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РешениеПричина</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийФайл</name>
    <type>
      <types>CatalogRef.ОтказВВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийФайлИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийФайлРазмер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийФайлРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийФайлТип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПодтверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиПодтверждения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждениеПолученоСФР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрахователяФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерСФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТерриториальногоОрганаФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>135</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПодчиненностиФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящееЗаявление</name>
    <type>
      <types>DocumentRef.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>АПК:58 Краткий перечень сотрудников, включенных в документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВходящегоЗаявления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйСФРДолжность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>800</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйСФРТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйСФРФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантСФРДолжность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантСФРФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СотрудникФамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СотрудникИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СотрудникОтчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СотрудникСНИЛС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <comment>1 - мать, 2- отец, 3 - опекун, 4 - попечитель</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РебенокДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РебенокСНИЛС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиФикс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФиксацияИзменений</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НеобработанныеУзлы</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеСодержимого</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Documents/ОтказВВозмещенииВыплатРодителямДетейИнвалидов/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Страхователь)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ТекущиеДела

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	МетаданныеДокумента = Метаданные();
	Если Не СЭДОФСС.ДоступенОбменЧерезСЭДО()
		Или Не ПравоДоступа("Изменение", МетаданныеДокумента) Тогда
		Возврат; // Нет прав.
	КонецЕсли;
	
	МодульТекущиеДелаСервер = ОбщегоНазначения.ОбщийМодуль("ТекущиеДелаСервер");
	Разделы = МодульТекущиеДелаСервер.РазделыДляОбъекта(МетаданныеДокумента.ПолноеИмя());
	Если Разделы.Количество() = 0 Тогда
		Возврат; // Некорректное внедрение.
	КонецЕсли;
	
	Требования = ТребованияПоОтправке();
	ВРаботе                  = Требования.Количество();
	ТребуетсяЗагрузить       = Требования.НайтиСтроки(Новый Структура("ТребуетсяЗагрузить", Истина)).Количество();
	ТребуетсяОтветитьВсего   = Требования.НайтиСтроки(Новый Структура("ТребуетсяОтветить", Истина)).Количество();
	ТребуетсяОтветитьСегодня = Требования.НайтиСтроки(Новый Структура("ТребуетсяОтветитьСегодня", Истина)).Количество();
	ТребуетсяОтветитьЗавтра  = ТребуетсяОтветитьВсего - ТребуетсяОтветитьСегодня;
	ТребуетсяПодтвердить     = Требования.НайтиСтроки(Новый Структура("ТребуетсяПодтвердить", Истина)).Количество();
	ИмяДокумента             = МетаданныеДокумента.Имя;
	ПредставлениеСписка      = МетаданныеДокумента.ПредставлениеСписка;
	
	Для Каждого Раздел Из Разделы Цикл
		
		ПолноеИмяРаздела = СтрЗаменить(Раздел.ПолноеИмя(), ".", "_");
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = ИмяДокумента + "_ВРаботе_" + ПолноеИмяРаздела;
		Дело.ЕстьДела       = (ВРаботе > 0);
		Дело.Важное         = (ТребуетсяОтветитьСегодня > 0);
		Дело.Владелец       = Раздел;
		Дело.Представление  = ПредставлениеСписка;
		Дело.Количество     = ВРаботе;
		Дело.Подсказка      = НСтр("ru = 'Извещения о представлении недостающих документов для выплаты пособий СФР.'");
		Дело.ПараметрыФормы = Новый Структура("ТолькоВРаботе", Истина);
		Дело.Форма          = "Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов.ФормаСписка";
		
		ИдентификаторРодителя = Дело.Идентификатор;
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = ИмяДокумента + "_Загрузить_" + ПолноеИмяРаздела;
		Дело.ЕстьДела       = (ТребуетсяЗагрузить > 0);
		Дело.Важное         = Истина;
		Дело.Владелец       = ИдентификаторРодителя;
		Дело.Представление  = НСтр("ru = 'Получить новые извещения из СФР'");
		Дело.Количество     = ТребуетсяЗагрузить;
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = ИмяДокумента + "_ОтветитьСегодня_" + ПолноеИмяРаздела;
		Дело.ЕстьДела       = (ТребуетсяОтветитьСегодня > 0);
		Дело.Важное         = Истина;
		Дело.Владелец       = ИдентификаторРодителя;
		Дело.Представление  = НСтр("ru = 'Отправить недостающие сведения сегодня'");
		Дело.Количество     = ТребуетсяОтветитьСегодня;
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = ИмяДокумента + "_Ответить_" + ПолноеИмяРаздела;
		Дело.ЕстьДела       = (ТребуетсяОтветитьЗавтра > 0);
		Дело.Важное         = Ложь;
		Дело.Владелец       = ИдентификаторРодителя;
		Дело.Представление  = НСтр("ru = 'Отправить недостающие сведения'");
		Дело.Количество     = ТребуетсяОтветитьЗавтра;
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = ИмяДокумента + "_Подтвердить_" + ПолноеИмяРаздела;
		Дело.ЕстьДела       = (ТребуетсяПодтвердить > 0);
		Дело.Важное         = Ложь;
		Дело.Владелец       = ИдентификаторРодителя;
		Дело.Представление  = НСтр("ru = 'Подтвердить получение'");
		Дело.Количество     = ТребуетсяПодтвердить;
		
	КонецЦикла;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ТекущиеДела

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

#Область СЭДО

Функция ТипСообщения(Документ) Экспорт
	Возврат ?(Документ.ТипСообщения = 0, 122, Документ.ТипСообщения);
КонецФункции

Функция Метаданные() Экспорт
	Возврат Метаданные.Документы.ОтказВВозмещенииВыплатРодителямДетейИнвалидов;
КонецФункции

Процедура ЗаполнитьКонтекстПолученияДанныхВложения(Результат) Экспорт
	
	ИменаРеквизитов = "ВходящийФайл, Загружен, ДатаОтправкиПодтверждения, Обработан, ПодтверждениеПолученоСФР, ТребуетсяПодтверждение";
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Результат.Ссылка, ИменаРеквизитов);
	
	Результат.СсылкаФайла = Реквизиты.ВходящийФайл;
	Результат.Загружен = Реквизиты.Загружен;
	
	ПодтверждениеОтправлено = ЗначениеЗаполнено(Реквизиты.ДатаОтправкиПодтверждения)
		Или Реквизиты.ПодтверждениеПолученоСФР;
	
	Если Реквизиты.Обработан
		Или Не Реквизиты.ТребуетсяПодтверждение
		Или ПодтверждениеОтправлено
		Или Не ПравоДоступа("Изменение", Метаданные())
		Или Не Результат.ПравоСохранения Тогда
		Результат.ОтветНаВопрос = 2; // Открыть документ без лишних вопросов.
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СоставДокументов

// Возвращает описание состава документа
//
// Возвращаемое значение:
//   Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
//
Функция ОписаниеСоставаОбъекта() Экспорт
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(
		Метаданные());
КонецФункции

#КонецОбласти

#Область ФиксацияВторичныхДанныхВДокументах

Функция ПараметрыФиксацииВторичныхДанных() Экспорт
	ФиксируемыеРеквизиты = ФиксируемыеРеквизиты();
	ФиксируемыеТаблицы = Новый Структура("Оплаты", СтрРазделить("НомерСтроки", ","));
	Возврат ФиксацияВторичныхДанныхВДокументах.ПараметрыФиксации(ФиксируемыеРеквизиты, ФиксируемыеТаблицы);
КонецФункции

Функция ОбъектЗафиксирован(Документ) Экспорт
	Возврат Документ.Обработан;
КонецФункции

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область ФиксацияВторичныхДанныхВДокументах

Функция ФиксируемыеРеквизиты()
	ФиксируемыеРеквизиты = Новый Соответствие;
	
	// При помощи механизмов фиксации описываются только механизмы обновления вторичных данных.
	// Механизмы заполнения первичных данных при этом могут существенно отличаться.
	
	Шаблон = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Шаблон.ИмяГруппы           = "ПодтверждениеПолучения";
	Шаблон.ОснованиеЗаполнения = "ИдентификаторСообщения";
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ТребуетсяПодтверждение");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаОтправкиПодтверждения");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ПодтверждениеПолученоСФР");
	
	Шаблон = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Шаблон.ИмяГруппы           = "МаксимальнаяДатаПодтверждения";
	Шаблон.ОснованиеЗаполнения = "ДатаСообщения";
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "МаксимальнаяДатаПодтверждения");
	
	Шаблон = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Шаблон.ИмяГруппы           = "ВходящиеДокументы";
	Шаблон.ОснованиеЗаполнения = "ИдентификаторРеестра";
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ВходящееЗаявление");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "Организация");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "Ответственный");
	
	// Реквизиты табличной части "Оплаты".
	Шаблон = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Шаблон.ОснованиеЗаполнения = "СотрудникСНИЛС";
	Шаблон.ИмяГруппы           = "КадровыеДанные";
	Шаблон.РеквизитСтроки      = Истина;
	Шаблон.Путь                = "Оплаты";
	
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ФизическоеЛицо");
	
	Возврат Новый ФиксированноеСоответствие(ФиксируемыеРеквизиты);
КонецФункции

#КонецОбласти

#Область СЭДО

Процедура ЗагрузитьУведомлениеОНаличииСообщения(ТипСообщения, Страхователь, Уведомление, ЕстьИзменения) Экспорт
	ИдентификаторСообщения = Уведомление.Идентификатор;
	ТребуетсяПодтверждение = Уведомление.ТребуетсяПодтверждение;
	
	// Поиск документа по идентификатору сообщения.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.Дата КАК Дата,
	|	Шапка.ПометкаУдаления КАК ПометкаУдаления,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Страхователь КАК Страхователь,
	|	Шапка.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение
	|ИЗ
	|	Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов КАК Шапка
	|ГДЕ
	|	Шапка.ИдентификаторСообщения = &ИдентификаторСообщения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПометкаУдаления,
	|	Дата УБЫВ";
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.Страхователь = Страхователь
			И Не Выборка.ПометкаУдаления
			И ТребуетсяПодтверждение = Выборка.ТребуетсяПодтверждение Тогда
			Возврат;
		КонецЕсли;
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документы.ОтказВВозмещенииВыплатРодителямДетейИнвалидов.СоздатьДокумент();
	КонецЕсли;
	
	Если ДокументОбъект.ПометкаУдаления Тогда
		ДокументОбъект.УстановитьПометкуУдаления(Ложь);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
		ДокументОбъект.Организация = Страхователь;
	КонецЕсли;
	ДокументОбъект.ТипСообщения           = ТипСообщения;
	ДокументОбъект.Страхователь           = Страхователь;
	ДокументОбъект.ИдентификаторСообщения = ИдентификаторСообщения;
	ДокументОбъект.ТребуетсяПодтверждение = ТребуетсяПодтверждение;
	ДокументОбъект.ЗаполнитьДату();
	ЗаписатьДокумент(ДокументОбъект, РежимЗаписиДокумента.Запись);
	
	ЕстьИзменения = Истина;
КонецПроцедуры

Процедура ЗагрузитьСообщение(ТипСообщения, Страхователь, ИдентификаторСообщения, ТекстXML, Результат, Кэш) Экспорт
	#Область Пример_122
	// Пример XML сообщения 122:
	//<?xml version="1.0" encoding="UTF-8"?>
	//<n1:disabilityChildrenStatementReject xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:p="http://www.fss.ru/integration/types/person/v02" xmlns:cuq="http://www.fss.ru/integration/types/commonUq/v01" xmlns:dpt="http://www.fss.ru/integration/types/fssDepartment/v01" xmlns:n1="http://www.fss.ru/integration/types/pvso/disabilitychildren/v01" xsi:schemaLocation="http://www.fss.ru/integration/types/pvso/disabilitychildren/v01 disabilityChildrenStatement.xsd">
	//	<n1:msgDateTime>2024-07-01T09:30:47Z</n1:msgDateTime>
	//	<n1:tof>
	//		<dpt:code>a</dpt:code>
	//		<dpt:name>a</dpt:name>
	//	</n1:tof>
	//	<n1:batch_no>a</n1:batch_no>
	//	<n1:insurerInfo>
	//		<n1:regNum>5205004739</n1:regNum>
	//		<n1:regNumSFR>5205009999</n1:regNumSFR>
	//	</n1:insurerInfo>
	//	<n1:receiversRow>
	//		<n1:parentInfo>
	//			<n1:fullName>
	//				<p:firstName>Иванов</p:firstName>
	//				<p:lastName>Иван</p:lastName>
	//			</n1:fullName>
	//			<n1:snils>91366647226</n1:snils>
	//			<n1:childRelType>2</n1:childRelType>
	//		</n1:parentInfo>
	//		<n1:childInfo>
	//			<n1:snils>73287328218</n1:snils>
	//			<n1:birthDate>2017-08-13</n1:birthDate>
	//		</n1:childInfo>
	//		<n1:periods>
	//			<n1:daysAmount>1</n1:daysAmount>
	//			<n1:TotalHour>8</n1:TotalHour>
	//		</n1:periods>
	//	</n1:receiversRow>
	//	<n1:rejectionInfo>
	//		<n1:number>444</n1:number>
	//		<n1:date>2024-07-01</n1:date>
	//		<n1:reason>a</n1:reason>
	//	</n1:rejectionInfo>
	//	<cuq:attachment>
	//		<content>UjBsR09EbGhjZ0dTQUxNQUFBUUNBRU1tQ1p0dU1GUXhEUzhi</content>
	//	</cuq:attachment>
	//</n1:disabilityChildrenStatementReject>
	#КонецОбласти
	#Область Пример_12210
	//<?xml version="1.0" encoding="UTF-8"?>
	//<n1:disabilityChildrenStatementReject xmlns:p="urn:ru:ecp:integration:types:person:v3.0"
	//                                      xmlns:com="urn:ru:ecp:integration:types:common:v3.0"
	//                                      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	//                                      xmlns:att="urn:ru:ecp:integration:types:attachment:v3.0"
	//                                      xmlns:n1="urn:ru:ecp:integration:wozm:refund:disabilitychildren:sttmnt:reject:v3.0"
	//                                      xmlns:dis="urn:ru:ecp:integration:wozm:refund:disabilitychildren:sttmnt:v3.0"
	//                                      specVersion="3.0.0"
	//                                      responseOn="1441a09e-d492-4464-b674-e12db482c8f3"
	//                                      messageDateTime="2025-09-20T09:30:47Z"
	//                                      xsi:schemaLocation="urn:ru:ecp:integration:wozm:refund:disabilitychildren:sttmnt:reject:v3.0 DisabilityChildrenStatementReject.xsd">
	//	<n1:tof>
	//		<com:code>086</com:code>
	//		<com:name>ОСФР ПО ЯРОСЛАВСКОЙ ОБЛАСТИ</com:name>
	//	</n1:tof>
	//	<n1:batch_no>520520240705847849</n1:batch_no>
	//	<n1:insurerInfo>
	//		<n1:regNum>5205004739</n1:regNum>
	//		<n1:regNumSFR>5205009999</n1:regNumSFR>
	//	</n1:insurerInfo>
	//	<n1:receiversRow>
	//		<n1:parentInfo>
	//			<dis:fullName>
	//				<p:firstName>Алла</p:firstName>
	//				<p:lastName>Тарасова</p:lastName>
	//				<p:middleName>Ивановна</p:middleName>
	//			</dis:fullName>
	//			<dis:snils>43084477684</dis:snils>
	//			<dis:childRelType>2</dis:childRelType>
	//		</n1:parentInfo>
	//		<n1:childInfo>
	//			<n1:snils>42869140104</n1:snils>
	//			<n1:birthDate>2024-06-20</n1:birthDate>
	//		</n1:childInfo>
	//		<n1:periods>
	//			<n1:daysAmount>1</n1:daysAmount>
	//			<n1:TotalHour>8</n1:TotalHour>
	//		</n1:periods>
	//	</n1:receiversRow>
	//	<n1:rejectionInfo>
	//		<n1:number>24072024</n1:number>
	//		<n1:date>2024-07-24+03:00</n1:date>
	//		<n1:reason>Тестовый текст отказа</n1:reason>
	//	</n1:rejectionInfo>
	//	<att:attachment>
	//		<att:content>0JLQu9C+0LbQtdC90LjQtSDRgSDQvtGC0LrQsNC30L7QvA==</att:content>
	//		<att:ext>pdf</att:ext>
	//		<att:size>69681</att:size>
	//	</att:attachment>
	//	<n1:senderInfo>
	//		<n1:fullName>Петров Петр Петрович</n1:fullName>
	//		<n1:role>Заместитель начальника отдела назначения</n1:role>
	//		<n1:phone>+7 495 123 45 78 (1234)</n1:phone>
	//	</n1:senderInfo>
	//	<n1:signatoryInfo>
	//		<n1:fullName>Васильев Василий Васильевич</n1:fullName>
	//		<n1:role>Начальник отдела назначения</n1:role>
	//	</n1:signatoryInfo>
	//</n1:disabilityChildrenStatementReject>
	#КонецОбласти
	
	// Поиск корневого узла.
	СтруктураDOM = СериализацияБЗК.СтруктураDOM(ТекстXML);
	КореньDOM = СериализацияБЗК.НайтиУзелDOMПоИмени(СтруктураDOM, "disabilityChildrenStatementReject");
	Если КореньDOM = Неопределено Тогда
		КореньDOM = СтруктураDOM.ДокументDOM.ЭлементДокумента;
	КонецЕсли;
	
	// Чтение реквизитов.
	АтрибутыКорня = СериализацияБЗК.АтрибутыЭлементаDOM(КореньDOM, "specVersion, responseOn, messageDateTime");
	ВерсияСпецификации = СериализацияБЗК.СтрокаИзXML(АтрибутыКорня.specVersion);
	ИдентификаторВходящегоЗаявления = АтрибутыКорня.responseOn;
	ДатаСообщения = СериализацияБЗК.ДатаИзXML(АтрибутыКорня.messageDateTime);
	
	Имена = "msgDateTime, tof, batch_no, insurerInfo, receiversRow, rejectionInfo, attachment, senderInfo, signatoryInfo";
	Необработанные = Новый Массив;
	УзлыКорня = СериализацияБЗК.УзлыЭлементаDOM(КореньDOM, Имена, Необработанные);
	
	Если Не ЗначениеЗаполнено(ДатаСообщения) Тогда
		ДатаСообщения = СериализацияБЗК.ДатаИзXML(УзлыКорня.msgDateTime);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаСообщения) Тогда
		ДатаСообщения = СЭДОФСС.ДатаСообщения(ИдентификаторСообщения, Кэш);
	КонецЕсли;
	
	УзлыТОФ = СериализацияБЗК.УзлыЭлементаDOM(УзлыКорня.tof, "code, name", Необработанные);
	КодПодчиненностиФСС                   = СериализацияБЗК.СтрокаИзXML(УзлыТОФ.code);
	НаименованиеТерриториальногоОрганаФСС = СериализацияБЗК.СтрокаИзXML(УзлыТОФ.name);
	
	ИдентификаторРеестра = СериализацияБЗК.СтрокаИзXML(УзлыКорня.batch_no);
	
	УзлыСтрахователя = СериализацияБЗК.УзлыЭлементаDOM(УзлыКорня.insurerInfo, "regNum, regNumSFR", Необработанные);
	НомерСтрахователяФСС    = СериализацияБЗК.СтрокаИзXML(УзлыСтрахователя.regNum);
	РегистрационныйНомерСФР = СериализацияБЗК.СтрокаИзXML(УзлыСтрахователя.regNumSFR);
	
	ТаблицаПолучателей = Новый ТаблицаЗначений;
	ТаблицаПолучателей.Колонки.Добавить("СотрудникИмя", ОбщегоНазначения.ОписаниеТипаСтрока(60));
	ТаблицаПолучателей.Колонки.Добавить("СотрудникФамилия", ОбщегоНазначения.ОписаниеТипаСтрока(60));
	ТаблицаПолучателей.Колонки.Добавить("СотрудникОтчество", ОбщегоНазначения.ОписаниеТипаСтрока(60));
	ТаблицаПолучателей.Колонки.Добавить("СотрудникСНИЛС", ОбщегоНазначения.ОписаниеТипаСтрока(14));
	ТаблицаПолучателей.Колонки.Добавить("Статус", ОбщегоНазначения.ОписаниеТипаСтрока(1));
	ТаблицаПолучателей.Колонки.Добавить("РебенокСНИЛС", ОбщегоНазначения.ОписаниеТипаСтрока(14));
	ТаблицаПолучателей.Колонки.Добавить("РебенокДатаРождения", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаПолучателей.Колонки.Добавить("КоличествоДней", ОбщегоНазначения.ОписаниеТипаЧисло(2, 0));
	ТаблицаПолучателей.Колонки.Добавить("КоличествоЧасов", ОбщегоНазначения.ОписаниеТипаЧисло(2, 0));
	Если УзлыКорня.receiversRow <> Неопределено Тогда
		Если ТипЗнч(УзлыКорня.receiversRow) <> Тип("Массив") Тогда
			УзлыКорня.receiversRow = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(УзлыКорня.receiversRow);
		КонецЕсли;
		Для Каждого ПолучательDOM Из УзлыКорня.receiversRow Цикл
			УзлыПолучателя = СериализацияБЗК.УзлыЭлементаDOM(ПолучательDOM, "parentInfo, childInfo, periods", Необработанные);
			Если УзлыПолучателя.parentInfo = Неопределено Или УзлыПолучателя.childInfo = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СтрокаПолучатель = ТаблицаПолучателей.Добавить();
			
			// Сведения о родителе (опекуне, попечителе).
			УзлыСотрудника = СериализацияБЗК.УзлыЭлементаDOM(УзлыПолучателя.parentInfo, "fullName, snils, childRelType", Необработанные);
			УзлыФИО        = СериализацияБЗК.УзлыЭлементаDOM(УзлыСотрудника.fullName, "firstName, lastName, middleName", Необработанные);
			СтрокаПолучатель.СотрудникИмя      = СериализацияБЗК.СтрокаИзXML(УзлыФИО.firstName);
			СтрокаПолучатель.СотрудникФамилия  = СериализацияБЗК.СтрокаИзXML(УзлыФИО.lastName);
			СтрокаПолучатель.СотрудникОтчество = СериализацияБЗК.СтрокаИзXML(УзлыФИО.middleName);
			СтрокаПолучатель.СотрудникСНИЛС    = СЭДОФСС.СНИЛСИзXML(УзлыСотрудника.snils);
			СтрокаПолучатель.Статус            = СериализацияБЗК.СтрокаИзXML(УзлыСотрудника.childRelType);
			
			// Сведения о ребенке.
			УзлыРебенка = СериализацияБЗК.УзлыЭлементаDOM(УзлыПолучателя.childInfo, "snils, birthDate", Необработанные);
			СтрокаПолучатель.РебенокСНИЛС        = СЭДОФСС.СНИЛСИзXML(УзлыРебенка.snils);
			СтрокаПолучатель.РебенокДатаРождения = СериализацияБЗК.ДатаИзXML(УзлыРебенка.birthDate);
			
			// Таблицы дней.
			СтрокаПериод = Неопределено;
			Если УзлыПолучателя.periods <> Неопределено Тогда
				Если ТипЗнч(УзлыПолучателя.periods) <> Тип("Массив") Тогда
					УзлыПолучателя.periods = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(УзлыПолучателя.periods);
				КонецЕсли;
				Для Каждого ПериодDOM Из УзлыПолучателя.periods Цикл
					Если СтрокаПериод = Неопределено Тогда
						СтрокаПериод = СтрокаПолучатель;
					Иначе
						СтрокаПериод = ТаблицаПолучателей.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаПериод, СтрокаПолучатель);
					КонецЕсли;
					УзлыПериода = СериализацияБЗК.УзлыЭлементаDOM(ПериодDOM, "daysAmount, TotalHour", Необработанные);
					СтрокаПериод.КоличествоДней  = СериализацияБЗК.ЧислоИзXML(УзлыПериода.daysAmount);
					СтрокаПериод.КоличествоЧасов = СериализацияБЗК.ЧислоИзXML(УзлыПериода.TotalHour);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	УзлыРешения = СериализацияБЗК.УзлыЭлементаDOM(УзлыКорня.rejectionInfo, "number, date, reason", Необработанные);
	РешениеНомер   = СериализацияБЗК.СтрокаИзXML(УзлыРешения.number);
	РешениеДата    = СериализацияБЗК.ДатаИзXML(УзлыРешения.date);
	РешениеПричина = СериализацияБЗК.СтрокаИзXML(УзлыРешения.reason);
	
	УзлыВложения = СериализацияБЗК.УзлыЭлементаDOM(УзлыКорня.attachment, "content, ext, mimeType, size, name", Необработанные);
	ВложениеДанные     = СериализацияБЗК.ЗначениеИзXML(УзлыВложения.content, Тип("ДвоичныеДанные"));
	ВложениеРасширение = СериализацияБЗК.СтрокаИзXML(УзлыВложения.ext);
	ВложениеТип        = СериализацияБЗК.СтрокаИзXML(УзлыВложения.mimeType);
	ВложениеРазмер     = СериализацияБЗК.ЧислоИзXML(УзлыВложения.size);
	ВложениеИмяФайла   = СериализацияБЗК.СтрокаИзXML(УзлыВложения.name);
	
	// Данные работника СФР направившего извещение.
	ОтветственныйСФРФИО = Неопределено;
	ОтветственныйСФРДолжность = Неопределено;
	ОтветственныйСФРТелефон = Неопределено;
	Если УзлыКорня.senderInfo <> Неопределено Тогда
		УзлыСФР = СериализацияБЗК.УзлыЭлементаDOM(УзлыКорня.senderInfo, "fullName, role, phone", Необработанные);
		ОтветственныйСФРФИО = СериализацияБЗК.СтрокаИзXML(УзлыСФР.fullName);
		ОтветственныйСФРДолжность = СериализацияБЗК.СтрокаИзXML(УзлыСФР.role);
		ОтветственныйСФРТелефон = СериализацияБЗК.СтрокаИзXML(УзлыСФР.phone);
	КонецЕсли;
	
	// Данные работника СФР подписавшего извещение.
	ПодписантСФРФИО = Неопределено;
	ПодписантСФРДолжность = Неопределено;
	Если УзлыКорня.signatoryInfo <> Неопределено Тогда
		УзлыСФР = СериализацияБЗК.УзлыЭлементаDOM(УзлыКорня.signatoryInfo, "fullName, role", Необработанные);
		ПодписантСФРФИО = СериализацияБЗК.СтрокаИзXML(УзлыСФР.fullName);
		ПодписантСФРДолжность = СериализацияБЗК.СтрокаИзXML(УзлыСФР.role);
	КонецЕсли;
	
	НеобработанныеУзлы = СЭДОФСС.ТаблицаЭлементовDOM(Необработанные);
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Попытка
		// Поиск документа по идентификатору сообщения.
		ДокументОбъект = СоздатьДокументПоСообщению(Страхователь, ИдентификаторСообщения);
		
		// Обновление реквизитов документа.
		Если Не ДокументОбъект.Загружен Тогда
			ДокументОбъект.Дата = ТекущаяДатаСеанса();
			ДокументОбъект.Загружен = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ДокументОбъект.ДатаСообщения)
			Или ДокументОбъект.ДатаСообщения > ДатаСообщения
			Или ДокументОбъект.ДатаСообщения = НачалоДня(ДатаСообщения) Тогда
			ДокументОбъект.ДатаСообщения = ДатаСообщения;
		КонецЕсли;
		ДокументОбъект.ТипСообщения = ТипСообщения;
		ДокументОбъект.ВерсияСпецификации = ВерсияСпецификации;
		ДокументОбъект.ИдентификаторВходящегоЗаявления = ИдентификаторВходящегоЗаявления;
		ДокументОбъект.КодПодчиненностиФСС = КодПодчиненностиФСС;
		ДокументОбъект.НаименованиеТерриториальногоОрганаФСС = НаименованиеТерриториальногоОрганаФСС;
		ДокументОбъект.ИдентификаторРеестра = ИдентификаторРеестра;
		ДокументОбъект.НомерСтрахователяФСС = НомерСтрахователяФСС;
		ДокументОбъект.РегистрационныйНомерСФР = РегистрационныйНомерСФР;
		ДокументОбъект.РешениеНомер = РешениеНомер;
		ДокументОбъект.РешениеДата = РешениеДата;
		ДокументОбъект.РешениеПричина = РешениеПричина;
		ДокументОбъект.ВходящийФайлРасширение = ВложениеРасширение;
		ДокументОбъект.ВходящийФайлТип = ВложениеТип;
		ДокументОбъект.ВходящийФайлРазмер = ВложениеРазмер;
		ДокументОбъект.ВходящийФайлИмя = ВложениеИмяФайла;
		ДокументОбъект.ОтветственныйСФРФИО = ОтветственныйСФРФИО;
		ДокументОбъект.ОтветственныйСФРДолжность = ОтветственныйСФРДолжность;
		ДокументОбъект.ОтветственныйСФРТелефон = ОтветственныйСФРТелефон;
		ДокументОбъект.ПодписантСФРФИО = ПодписантСФРФИО;
		ДокументОбъект.ПодписантСФРДолжность = ПодписантСФРДолжность;
		Если ТаблицаПолучателей.Количество() > 0 Тогда
			ДокументОбъект.Оплаты.Загрузить(ТаблицаПолучателей);
		КонецЕсли;
		Если НеобработанныеУзлы.Количество() > 0 Тогда
			ДокументОбъект.НеобработанныеУзлы.Загрузить(НеобработанныеУзлы);
		КонецЕсли;
		
		ДокументОбъект.ОбновитьВторичныеДанные();
		ЗаписатьДокумент(ДокументОбъект, РежимЗаписиДокумента.Запись);
		
		Если ТипЗнч(ВложениеДанные) = Тип("ДвоичныеДанные") Тогда
			// Обновление присоединенного файла.
			ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла("Идентификатор, Кодировка");
			ПараметрыФайла.РасширениеБезТочки = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ВложениеРасширение);
			ПараметрыФайла.Служебный          = Истина;
			ПараметрыФайла.Идентификатор      = ИдентификаторСообщения;
			ПараметрыФайла.ИмяБезРасширения   = РешениеИмяФайлаБезРасширения(ДокументОбъект);
			ПараметрыФайла.ВладелецФайлов     = ДокументОбъект.Ссылка;
			ВходящийФайл = ОбновитьФайл(ВложениеДанные, ПараметрыФайла);
			
			// Запись ссылки на файл в реквизиты документа.
			ДокументОбъект.Прочитать();
			Если ДокументОбъект.ВходящийФайл <> ВходящийФайл Тогда
				ДокументОбъект.ВходящийФайл = ВходящийФайл;
				ДокументОбъект.ОбновитьВторичныеДанные();
				ЗаписатьДокумент(ДокументОбъект, РежимЗаписиДокумента.Запись);
			КонецЕсли;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		Результат.Обработано = Истина;
	Исключение
		ОтменитьТранзакцию();
		СЭДОФСС.ОшибкаОбработки(Результат, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

// См. ЭлектронныйДокументооборотСФССПереопределяемый.ПослеПолученияОтветаНаПодтверждениеОПрочтении.
Процедура ЗагрузитьОтветНаПодтверждениеПолученияСообщения(Страхователь, ИсходноеСообщение, Результат, ЕстьИзменения) Экспорт
	// Вызывается при получении сообщения с типом 11 в ответ на подтверждение о прочтении входящего сообщения.
	//   Страхователь - СправочникСсылка.Организации - организация, получатель сообщения.
	//   ИсходноеСообщение - Структура:
	//     * ИдентификаторСообщения - Строка - идентификатор исходного сообщения СЭДО, по которому отправлялось подтверждение.
	//     * Тип                    - Число  - тип исходного сообщения СЭДО, по которому отправлялось подтверждение.
	//     * ТекстОшибки            - Строка - ошибка приема подтверждения.
	//     * ТекстПредупреждения    - Строка - предупреждение приема подтверждения.
	//   Результат - Структура - результат обработки сообщения:
	//     * Обработано      - Булево - признак того, что сообщение было успешно обработано.
	//     * ОшибкаОбработки - Булево - признак того, что при обработке сообщения возникла ошибка.
	//     * ОписаниеОшибки  - Строка - описание ошибки обработки.
	
	// Поиск документа по идентификатору сообщения.
	Ссылка = НайтиДокументПоСообщению(Страхователь, ИсходноеСообщение.ИдентификаторСообщения);
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение подтверждения получения.
	ДокументОбъект = Ссылка.ПолучитьОбъект();
	Если ДокументОбъект.ЗаполнитьПодтверждениеПолучения(Неопределено) Тогда
		ЗаписатьДокумент(ДокументОбъект, РежимЗаписиДокумента.Запись);
		ЕстьИзменения = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция РешениеИмяФайлаБезРасширения(Документ)
	Если ЗначениеЗаполнено(Документ.ВходящийФайлИмя) Тогда
		Возврат Документ.ВходящийФайлИмя;
	КонецЕсли;
	Текст = НСтр("ru = 'Отказ в возмещении доп. выходных дней № %1 от %2'");
	Если ЗначениеЗаполнено(Документ.РешениеДата) Тогда
		Возврат СтрШаблон(Текст, Документ.РешениеНомер, Формат(Документ.РешениеДата, "ДФ=yyyy-MM-dd"));
	Иначе
		Возврат СтрШаблон(Текст, Документ.Номер, Формат(Документ.Дата, "ДФ=yyyy-MM-dd"));
	КонецЕсли;
КонецФункции

Функция НайтиДокументПоСообщению(Страхователь, ИдентификаторСообщения)
	ВыбираемыеПоля = "Ссылка";
	НастройкиЗапроса = ЗапросыБЗК.НастройкиЗапросаКТаблице();
	НастройкиЗапроса.Количество = 1;
	ЗапросыБЗК.ДобавитьОтбор(НастройкиЗапроса.Отбор, "ИдентификаторСообщения", , ИдентификаторСообщения);
	ЗапросыБЗК.ДобавитьОтбор(НастройкиЗапроса.Отбор, "Страхователь",           , Страхователь);
	Запрос = ЗапросыБЗК.ЗапросКТаблице(Метаданные(), ВыбираемыеПоля, НастройкиЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция СоздатьДокументПоСообщению(Страхователь, ИдентификаторСообщения)
	Ссылка = НайтиДокументПоСообщению(Страхователь, ИдентификаторСообщения);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ссылка.ПолучитьОбъект();
	Иначе
		Объект = СоздатьДокумент();
		Объект.Страхователь = Страхователь;
		Объект.ИдентификаторСообщения = ИдентификаторСообщения;
		Возврат Объект;
	КонецЕсли;
КонецФункции

Функция ОбновитьФайл(ДвоичныеДанныеФайла, ПараметрыФайла)
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ИЗ
	|	&ИсточникДанных КАК ПрисоединенныеФайлы
	|ГДЕ
	|	ПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	|	И ПрисоединенныеФайлы.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("ВладелецФайла", ПараметрыФайла.ВладелецФайлов);
	Запрос.УстановитьПараметр("Идентификатор", ПараметрыФайла.Идентификатор);
	
	ИмяОбъекта = ПараметрыФайла.ВладелецФайлов.Метаданные().Имя;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИсточникДанных", "Справочник." + ИмяОбъекта + "ПрисоединенныеФайлы"); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	АдресДвоичныхДанных = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла);
	
	Если Выборка.Следующий() Тогда 
		СсылкаФайла = Выборка.Ссылка;
		ПараметрыФайла.Вставить("АдресФайлаВоВременномХранилище", АдресДвоичныхДанных);
		ПараметрыФайла.Вставить("АдресВременногоХранилищаТекста", "");
		РаботаСФайлами.ОбновитьФайл(СсылкаФайла, ПараметрыФайла);
	Иначе
		СсылкаФайла = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресДвоичныхДанных);
	КонецЕсли;
	
	Возврат СсылкаФайла;
КонецФункции

#КонецОбласти

#Область Регламенты

Функция МаксимальнаяДатаПодтвержденияПолучения(Объект) Экспорт
	Возврат СЭДОФСС.СледующийРабочийДень(Объект.ДатаСообщения, РабочихДнейНаПодтверждениеПолучения());
КонецФункции

// См. п.7 Положения № 1 утвержденного Постановлением Правительства РФ от 21.04.2011 N 294.
Функция РабочихДнейНаПодтверждениеПолучения()
	Возврат 1;
КонецФункции

#КонецОбласти

#Область ТекущиеДела

Функция ТребованияПоОтправке()
	НачалоТекущегоДня = НачалоДня(ТекущаяДатаСеанса());
	НачалоРабочегоДня = НачалоДня(СЭДОФСС.БлижайшийРабочийДень(НачалоТекущегоДня));
	// Бумагу отправляют через 2-3 дня, а на подтверждение получения дается 1 день.
	НачалоТекущегоДняМинусДваДня = НачалоТекущегоДня - 86400 * 2;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Ссылка КАК Ссылка,
	|	НЕ Шапка.Загружен КАК ТребуетсяЗагрузить,
	|	Шапка.Загружен КАК ТребуетсяОтветить,
	|	ЛОЖЬ КАК ТребуетсяОтветитьСегодня,
	|	ВЫБОР
	|		КОГДА Шапка.Загружен
	|				И НЕ Шапка.ПодтверждениеПолученоСФР
	|				И Шапка.ДатаОтправкиПодтверждения = &ПустаяДата
	|				И Шапка.МаксимальнаяДатаПодтверждения >= &НачалоТекущегоДняМинусДваДня
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТребуетсяПодтвердить
	|ИЗ
	|	Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов КАК Шапка
	|ГДЕ
	|	НЕ Шапка.Обработан
	|	И НЕ Шапка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НачалоРабочегоДня", НачалоРабочегоДня);
	Запрос.УстановитьПараметр("НачалоТекущегоДняМинусДваДня", НачалоТекущегоДняМинусДваДня);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

#Область ФизическиеЛица

Процедура ПриИзмененииСНИЛСФизическогоЛица(ФизическоеЛицо, СтарыйСНИЛС, НовыйСНИЛС) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабличнаяЧасть.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Оплаты КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.СотрудникСНИЛС = &НовыйСНИЛС
	|	И ТабличнаяЧасть.ФизическоеЛицо <> &ФизическоеЛицо
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.Ссылка
	|ИЗ
	|	Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Оплаты КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.ФизическоеЛицо = &ФизическоеЛицо
	|	И ТабличнаяЧасть.СотрудникСНИЛС <> &НовыйСНИЛС";
	Если ЗначениеЗаполнено(НовыйСНИЛС) Тогда
		Запрос.УстановитьПараметр("НовыйСНИЛС", НовыйСНИЛС);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТабличнаяЧасть.СотрудникСНИЛС = &НовыйСНИЛС", "ЛОЖЬ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТабличнаяЧасть.СотрудникСНИЛС <> &НовыйСНИЛС", "ИСТИНА");
	КонецЕсли;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаВыборки Из Таблица Цикл
		Если Не ЗначениеЗаполнено(СтрокаВыборки.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		ЕстьИзменения = Ложь;
		ДокументОбъект = СтрокаВыборки.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаТаблицы Из ДокументОбъект.Оплаты Цикл
			Если СтрокаТаблицы.СотрудникСНИЛС = НовыйСНИЛС И ЗначениеЗаполнено(НовыйСНИЛС) Тогда
				СтрокаТаблицы.ФизическоеЛицо = ФизическоеЛицо;
			ИначеЕсли СтрокаТаблицы.ФизическоеЛицо = ФизическоеЛицо И СтрокаТаблицы.СотрудникСНИЛС <> НовыйСНИЛС Тогда
				СтрокаТаблицы.ФизическоеЛицо = Неопределено;
			Иначе
				Продолжить;
			КонецЕсли;
			ЕстьИзменения = Истина;
			ФиксацияВторичныхДанныхВДокументах.ОтменитьФиксациюРеквизитаТаблицы(
				ДокументОбъект,
				"Оплаты",
				СтрокаТаблицы,
				"ФизическоеЛицо");
		КонецЦикла;
		Если ЕстьИзменения Тогда
			ЗаписатьДокумент(ДокументОбъект, РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

Процедура ЗаписатьДокумент(ДокументОбъект, РежимЗаписи) Экспорт
	СЭДОФСС.ЗаписатьДокумент(ДокументОбъект, Истина, "БЗК", РежимЗаписи);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
